ArduPilot/ardupilot/libraries/AP_HAL_ChibiOS/hwdef/common/stm32h7_mcuconf.h
/*
    ChibiOS - Copyright (C) 2006..2018 Giovanni Di Sirio

    Licensed under the Apache License, Version 2.0 (the "License");
    you may not use this file except in compliance with the License.
    You may obtain a copy of the License at

        http://www.apache.org/licenses/LICENSE-2.0

    Unless required by applicable law or agreed to in writing, software
    distributed under the License is distributed on an "AS IS" BASIS,
    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
    See the License for the specific language governing permissions and
    limitations under the License.
*/
/*
  this header is modelled on the one for the Nucleo-144 H743 board from ChibiOS
 */
#pragma once

// we want to cope with both revision XY chips and newer chips
#if !defined(HAL_CUSTOM_MCU_CLOCKRATE) || HAL_CUSTOM_MCU_CLOCKRATE <= 400000000
#define STM32_ENFORCE_H7_REV_XY
#endif

#ifndef STM32_LSECLK
#define STM32_LSECLK 32768U
#endif
#ifndef STM32_LSEDRV
#define STM32_LSEDRV                (3U << 3U)
#endif

/*
 * STM32H7xx drivers configuration.
 * The following settings override the default settings present in
 * the various device driver implementation headers.
 * Note that the settings for each driver only have effect if the whole
 * driver is enabled in halconf.h.
 *
 * IRQ priorities:
 * 15...0       Lowest...Highest.
 *
 * DMA priorities:
 * 0...3        Lowest...Highest.
 */

#define STM32H7xx_MCUCONF
#define STM32H742_MCUCONF
#define STM32H743_MCUCONF
#define STM32H753_MCUCONF
#define STM32H745_MCUCONF
#define STM32H750_MCUCONF
#define STM32H755_MCUCONF
#define STM32H747_MCUCONF
#define STM32H757_MCUCONF
#define STM32H723_MCUCONF

/*
 * General settings.
 */
#ifndef STM32_NO_INIT
#define STM32_NO_INIT                       FALSE
#endif
#define STM32_TARGET_CORE                   1

/*
 * Memory attributes settings.
 */
// #define STM32_NOCACHE_ENABLE                TRUE
#define STM32_NOCACHE_MPU_REGION_ETH            MPU_REGION_6
// #define STM32_NOCACHE_RBAR                  0x30040000U
// #define STM32_NOCACHE_RASR                  MPU_RASR_SIZE_32K

// enable memory protection on SRAM4, used for bdshot
#define STM32_NOCACHE_MPU_REGION_1          MPU_REGION_5
#define STM32_NOCACHE_MPU_REGION_1_BASE     0x38000000U
#define STM32_NOCACHE_MPU_REGION_1_SIZE     MPU_RASR_SIZE_64K

/*
 * PWR system settings.
 * Reading STM32 Reference Manual is required, settings in PWR_CR3 are
 * very critical.
 * Register constants are taken from the ST header.
 */
#define STM32_PWR_CR1                       (PWR_CR1_SVOS_1 | PWR_CR1_SVOS_0)
#define STM32_PWR_CR2                       (PWR_CR2_BREN)
#ifdef SMPS_PWR
#define STM32_PWR_CR3                       (PWR_CR3_SMPSEN | PWR_CR3_USB33DEN)
#elif defined(SMPS_EXT)
#define STM32_PWR_CR3                       (PWR_CR3_BYPASS | PWR_CR3_USB33DEN)
#else
#define STM32_PWR_CR3                       (PWR_CR3_LDOEN | PWR_CR3_USB33DEN)
#endif
#define STM32_PWR_CPUCR                     0

/*
 * Clock tree static settings.
 * Reading STM32 Reference Manual is required.
 */
#define STM32_LSI_ENABLED                   FALSE
#define STM32_CSI_ENABLED                   FALSE
#define STM32_HSI48_ENABLED                 TRUE
#define STM32_LSE_ENABLED                   FALSE
#define STM32_HSIDIV                        STM32_HSIDIV_DIV1

/*
 * Clock setup for all other H7 variants including H743, H723, H753, H750 and H757
 */
#define STM32_VOS                           STM32_VOS_SCALE1
/*
  setup PLLs based on HSE clock
 */
#if STM32_HSECLK == 0U
// no crystal, this gives 400MHz system clock
#define STM32_HSE_ENABLED                   FALSE
#define STM32_HSI_ENABLED                   TRUE
#define STM32_PLL1_DIVM_VALUE               4
#define STM32_PLL2_DIVM_VALUE               8
#define STM32_PLL3_DIVM_VALUE               4
#define STM32_PLLSRC                        STM32_PLLSRC_HSI_CK
#define STM32_MCO1SEL                       STM32_MCO1SEL_HSI_CK
#define STM32_CKPERSEL                      STM32_CKPERSEL_HSI_CK

#elif STM32_HSECLK == 8000000U
// this gives 400MHz system clock
#define STM32_HSE_ENABLED                   TRUE
#define STM32_HSI_ENABLED                   FALSE
#define STM32_PLL1_DIVM_VALUE               1
#define STM32_PLL2_DIVM_VALUE               1
#define STM32_PLL3_DIVM_VALUE               2

#elif STM32_HSECLK == 12000000U
// this gives 400MHz system clock
#define STM32_HSE_ENABLED                   TRUE
#define STM32_HSI_ENABLED                   FALSE
#define STM32_PLL1_DIVM_VALUE               3
#define STM32_PLL2_DIVM_VALUE               1
#define STM32_PLL3_DIVM_VALUE               3

#elif STM32_HSECLK == 16000000U
// this gives 400MHz system clock
#define STM32_HSE_ENABLED                   TRUE
#define STM32_HSI_ENABLED                   FALSE
#define STM32_PLL1_DIVM_VALUE               2
#define STM32_PLL2_DIVM_VALUE               2
#define STM32_PLL3_DIVM_VALUE               4

#elif STM32_HSECLK == 24000000U
// this gives 400MHz system clock
#define STM32_HSE_ENABLED                   TRUE
#define STM32_HSI_ENABLED                   FALSE
#define STM32_PLL1_DIVM_VALUE               3
#define STM32_PLL2_DIVM_VALUE               2
#define STM32_PLL3_DIVM_VALUE               6

#elif STM32_HSECLK == 25000000U
// this gives 400MHz system clock
#define STM32_HSE_ENABLED                   TRUE
#define STM32_HSI_ENABLED                   FALSE
#ifdef STM32H750xx
#define STM32_PLL1_DIVM_VALUE               5
#else
#define STM32_PLL1_DIVM_VALUE               2
#endif
#define STM32_PLL2_DIVM_VALUE               5
#define STM32_PLL3_DIVM_VALUE               5

#elif STM32_HSECLK == 32000000U
// this gives 400MHz system clock
#define STM32_HSE_ENABLED                   TRUE
#define STM32_HSI_ENABLED                   FALSE
#define STM32_PLL1_DIVM_VALUE               4
#define STM32_PLL2_DIVM_VALUE               4
#define STM32_PLL3_DIVM_VALUE               8

#else
#error "Unsupported HSE clock"
#endif

#if STM32_HSECLK == 0U
// no crystal
#define STM32_PLL1_DIVN_VALUE               50
#define STM32_PLL1_DIVP_VALUE               2
#define STM32_PLL1_DIVQ_VALUE               10
#define STM32_PLL1_DIVR_VALUE               2

