ArduPilot/ardupilot/libraries/AP_HAL_ChibiOS/hwdef/common/stm32h7_mcuconf.h
#define STM32_PLL2_DIVN_VALUE               45
#define STM32_PLL2_DIVP_VALUE               2
#define STM32_PLL2_DIVQ_VALUE               5
#define STM32_PLL2_DIVR_VALUE               8

#define STM32_PLL3_DIVN_VALUE               15
#define STM32_PLL3_DIVQ_VALUE               5
#define STM32_PLL3_DIVR_VALUE               8

#elif (STM32_HSECLK == 8000000U) || (STM32_HSECLK == 16000000U) || (STM32_HSECLK == 32000000U)
// common clock tree for multiples of 8MHz crystals
#ifdef HAL_CUSTOM_MCU_CLOCKRATE
#if HAL_CUSTOM_MCU_CLOCKRATE == 480000000
#define STM32_PLL1_DIVN_VALUE               120
#define STM32_PLL1_DIVQ_VALUE               12
#else
#error "Unable to configure custom clockrate"
#endif
#else
#define STM32_PLL1_DIVN_VALUE               100
#define STM32_PLL1_DIVQ_VALUE               10
#endif
#define STM32_PLL1_DIVP_VALUE               2
#define STM32_PLL1_DIVR_VALUE               2

#define STM32_PLL2_DIVN_VALUE               75
#define STM32_PLL2_DIVP_VALUE               3
#define STM32_PLL2_DIVQ_VALUE               6
#define STM32_PLL2_DIVR_VALUE               3

#define STM32_PLL3_DIVN_VALUE               72
#define STM32_PLL3_DIVQ_VALUE               6
#define STM32_PLL3_DIVR_VALUE               9

#elif STM32_HSECLK == 12000000U
#ifdef HAL_CUSTOM_MCU_CLOCKRATE
#if HAL_CUSTOM_MCU_CLOCKRATE == 480000000
#define STM32_PLL1_DIVN_VALUE               240
#define STM32_PLL1_DIVQ_VALUE               12
#elif HAL_CUSTOM_MCU_CLOCKRATE == 200000000
#define STM32_PLL1_DIVN_VALUE               100
#define STM32_PLL1_DIVQ_VALUE               5
#else
#error "Unable to configure custom clockrate"
#endif
#else
#define STM32_PLL1_DIVN_VALUE               200
#define STM32_PLL1_DIVQ_VALUE               10
#endif
#define STM32_PLL1_DIVP_VALUE               2
#define STM32_PLL1_DIVR_VALUE               2

#define STM32_PLL2_DIVN_VALUE               50
#define STM32_PLL2_DIVP_VALUE               3
#define STM32_PLL2_DIVQ_VALUE               6
#define STM32_PLL2_DIVR_VALUE               3

#define STM32_PLL3_DIVN_VALUE               72
#define STM32_PLL3_DIVQ_VALUE               6
#define STM32_PLL3_DIVR_VALUE               9

#elif STM32_HSECLK == 24000000U
#ifdef HAL_CUSTOM_MCU_CLOCKRATE
#if HAL_CUSTOM_MCU_CLOCKRATE == 480000000
#define STM32_PLL1_DIVN_VALUE               120
#define STM32_PLL1_DIVQ_VALUE               12
#elif HAL_CUSTOM_MCU_CLOCKRATE == 200000000
#define STM32_PLL1_DIVN_VALUE               50
#define STM32_PLL1_DIVQ_VALUE               5
#else
#error "Unable to configure custom clockrate"
#endif
#else
#define STM32_PLL1_DIVN_VALUE               100
#define STM32_PLL1_DIVQ_VALUE               10
#endif
#define STM32_PLL1_DIVP_VALUE               2
#define STM32_PLL1_DIVR_VALUE               2

#define STM32_PLL2_DIVN_VALUE               50
#define STM32_PLL2_DIVP_VALUE               3
#define STM32_PLL2_DIVQ_VALUE               6
#define STM32_PLL2_DIVR_VALUE               3

#define STM32_PLL3_DIVN_VALUE               72
#define STM32_PLL3_DIVQ_VALUE               6
#define STM32_PLL3_DIVR_VALUE               9

#elif STM32_HSECLK == 25000000U
#ifdef HAL_CUSTOM_MCU_CLOCKRATE
#if HAL_CUSTOM_MCU_CLOCKRATE == 480000000
#define STM32_PLL1_DIVN_VALUE               192
#define STM32_PLL1_DIVP_VALUE               2
#define STM32_PLL1_DIVQ_VALUE               12
#define STM32_PLL1_DIVR_VALUE               2
#else
#error "Unable to configure custom clockrate"
#endif
#else
#define STM32_PLL1_DIVN_VALUE               64
#define STM32_PLL1_DIVP_VALUE               2
#define STM32_PLL1_DIVQ_VALUE               10
#define STM32_PLL1_DIVR_VALUE               2
#endif

#define STM32_PLL2_DIVN_VALUE               120
#define STM32_PLL2_DIVP_VALUE               3
#define STM32_PLL2_DIVQ_VALUE               6
#define STM32_PLL2_DIVR_VALUE               3

#define STM32_PLL3_DIVN_VALUE               48
#define STM32_PLL3_DIVQ_VALUE               5
#define STM32_PLL3_DIVR_VALUE               8
#endif // clock selection

/*
 * PLLs static settings.
 * Reading STM32 Reference Manual is required.
 */
#ifndef STM32_PLLSRC
#define STM32_PLLSRC                        STM32_PLLSRC_HSE_CK
#endif
#define STM32_PLLCFGR_MASK                  ~0


#define STM32_PLL1_ENABLED                  TRUE
#define STM32_PLL1_P_ENABLED                TRUE
#define STM32_PLL1_Q_ENABLED                TRUE
#define STM32_PLL1_R_ENABLED                TRUE
#define STM32_PLL1_FRACN_VALUE              0

#define STM32_PLL2_ENABLED                  TRUE
#define STM32_PLL2_P_ENABLED                TRUE
#define STM32_PLL2_Q_ENABLED                TRUE
#define STM32_PLL2_R_ENABLED                TRUE
#define STM32_PLL2_FRACN_VALUE              0

#define STM32_PLL3_ENABLED                  TRUE
#define STM32_PLL3_P_ENABLED                FALSE
#define STM32_PLL3_Q_ENABLED                TRUE
#define STM32_PLL3_R_ENABLED                TRUE
#define STM32_PLL3_FRACN_VALUE              0

/*
 * Core clocks dynamic settings (can be changed at runtime).
 * Reading STM32 Reference Manual is required.
 */
#define STM32_SW                            STM32_SW_PLL1_P_CK
#define STM32_RTCSEL                        STM32_RTCSEL_NOCLK
#define STM32_D1CPRE                        STM32_D1CPRE_DIV1
#define STM32_D1HPRE                        STM32_D1HPRE_DIV2
#define STM32_D1PPRE3                       STM32_D1PPRE3_DIV2
#define STM32_D2PPRE1                       STM32_D2PPRE1_DIV2
#define STM32_D2PPRE2                       STM32_D2PPRE2_DIV2
#define STM32_D3PPRE4                       STM32_D3PPRE4_DIV2

/*
 * Peripherals clocks static settings.
 * Reading STM32 Reference Manual is required.
 */
#ifndef STM32_MCO1SEL
#define STM32_MCO1SEL                       STM32_MCO1SEL_HSE_CK
#endif
#ifndef STM32_MCO1PRE_VALUE
#define STM32_MCO1PRE_VALUE                 4
#endif
#ifndef STM32_MCO2SEL
#define STM32_MCO2SEL                       STM32_MCO2SEL_SYS_CK
#endif
#ifndef STM32_MCO2PRE_VALUE
#define STM32_MCO2PRE_VALUE                 4
#endif
#define STM32_TIMPRE_ENABLE                 TRUE
#define STM32_HRTIMSEL                      0
#define STM32_STOPKERWUCK                   0
#define STM32_STOPWUCK                      0
#define STM32_RTCPRE_VALUE                  8
#ifndef STM32_CKPERSEL
#define STM32_CKPERSEL                      STM32_CKPERSEL_HSE_CK
#endif
#define STM32_SDMMCSEL                      STM32_SDMMCSEL_PLL1_Q_CK
#ifndef STM32_QSPISEL
#define STM32_QSPISEL                       STM32_QSPISEL_PLL2_R_CK
#endif
#ifdef STM32_QSPISEL_HCLK
#define STM32_FMCSEL                        STM32_QSPISEL_HCLK
#endif

#define STM32_SWPSEL                        STM32_SWPSEL_PCLK1
#define STM32_FDCANSEL                      STM32_FDCANSEL_PLL1_Q_CK
#define STM32_DFSDM1SEL                     STM32_DFSDM1SEL_PCLK2
#define STM32_SPDIFSEL                      STM32_SPDIFSEL_PLL1_Q_CK
#define STM32_SPI45SEL                      STM32_SPI45SEL_PLL2_Q_CK
#define STM32_SPI123SEL                     STM32_SPI123SEL_PLL1_Q_CK
#ifdef STM32_SAI23SEL_PLL1_Q_CK
#define STM32_SAI23SEL                      STM32_SAI23SEL_PLL1_Q_CK
#endif
#define STM32_SAI1SEL                       STM32_SAI1SEL_PLL1_Q_CK
#define STM32_LPTIM1SEL                     STM32_LPTIM1SEL_PCLK1
#define STM32_CECSEL                        STM32_CECSEL_DISABLE
#define STM32_USBSEL                        STM32_USBSEL_PLL3_Q_CK
#define STM32_I2C123SEL                     STM32_I2C123SEL_PLL3_R_CK
#define STM32_RNGSEL                        STM32_RNGSEL_HSI48_CK
#define STM32_USART16SEL                    STM32_USART16SEL_PLL2_Q_CK
#define STM32_USART234578SEL                STM32_USART234578SEL_PLL2_Q_CK
#define STM32_SPI6SEL                       STM32_SPI6SEL_PLL2_Q_CK
#define STM32_SAI4BSEL                      STM32_SAI4BSEL_PLL1_Q_CK
#define STM32_SAI4ASEL                      STM32_SAI4ASEL_PLL1_Q_CK
#define STM32_ADCSEL                        STM32_ADCSEL_PLL3_R_CK
#define STM32_LPTIM345SEL                   STM32_LPTIM345SEL_PCLK4
#define STM32_LPTIM2SEL                     STM32_LPTIM2SEL_PCLK4
#define STM32_I2C4SEL                       STM32_I2C4SEL_PLL3_R_CK
#define STM32_LPUART1SEL                    STM32_LPUART1SEL_PCLK4

